return {
    -- 一年级第一学期口算题
    {
        ['sequence'] = 1,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '10以内加法',
        ['qtypes'] = {
            ['10以内加法'] = 100,
        }
    },
    {
        ['sequence'] = 2,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '10以内减法',
        ['qtypes'] = {
            ['10以内减法'] = 100,
        }
    },
    {
        ['sequence'] = 3,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '10以内加减综合',
        ['qtypes'] = {
            ['10以内加法'] = 50,
            ['10以内减法'] = 50,
        }
    },
    {
        ['sequence'] = 4,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '10以内连加',
        ['qtypes'] = {
            ['10以内连加'] = 100,
        }
    },
    {
        ['sequence'] = 5,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '10以内连减',
        ['qtypes'] = {
            ['10以内连减'] = 100,
        }
    },
    {
        ['sequence'] = 6,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '10以内连续加减综合',
        ['qtypes'] = {
            ['10以内连加'] = 25,
            ['10以内连减'] = 25,
            ['10以内减加'] = 25,
            ['10以内加减'] = 25,
        }
    },
    {
        ['sequence'] = 7,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内不进位加法',
        ['qtypes'] = {
            ['10以内加法'] = 20,
            ['20以内不进位加法'] = 80,
        }
    },
    {
        ['sequence'] = 8,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内不退位减法',
        ['qtypes'] = {
            ['10以内减法'] = 20,
            ['20以内不退位减法'] = 80,
        }
    },
    {
        ['sequence'] = 9,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内不进位不退位综合',
        ['qtypes'] = {
            ['10以内加法'] = 10,
            ['10以内减法'] = 10,
            ['20以内不进位加法'] = 40,
            ['20以内不退位减法'] = 40,
        }
    },
    {
        ['sequence'] = 10,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内进位加法',
        ['qtypes'] = {
            ['20以内进位加法'] = 100,
        }
    },
    {
        ['sequence'] = 11,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内退位减法',
        ['qtypes'] = {
            ['20以内退位减法'] = 100,
        }
    },
    {
        ['sequence'] = 12,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内进位退位加减综合',
        ['qtypes'] = {
            ['20以内进位加法'] = 50,
            ['20以内退位减法'] = 50,
        }
    },
    {
        ['sequence'] = 13,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内加减综合',
        ['qtypes'] = {
            ['10以内加法'] = 10,
            ['10以内减法'] = 10,
            ['20以内不进位加法'] = 20,
            ['20以内不退位减法'] = 20,
            ['20以内进位加法'] = 20,
            ['20以内退位减法'] = 20,
        }
    },
    {
        ['sequence'] = 14,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内连加',
        ['qtypes'] = {
            ['10以内连加'] = 20,
            ['20以内连加'] = 80,
        }
    },
    {
        ['sequence'] = 15,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内连减',
        ['qtypes'] = {
            ['10以内连减'] = 20,
            ['20以内连减'] = 80,
        }
    },
    {
        ['sequence'] = 16,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '20以内连续加减综合',
        ['qtypes'] = {
            ['10以内连加'] = 5,
            ['10以内连减'] = 5,
            ['10以内减加'] = 5,
            ['10以内加减'] = 5,
            ['20以内连加'] = 20,
            ['20以内连减'] = 20,
            ['20以内减加'] = 20,
            ['20以内加减'] = 20,
        }
    },
    {
        ['sequence'] = 17,
        ['grade'] = 1,
        ['semester'] = 1,
        ['name'] = '一年级上学期综合练习',
        ['qtypes'] = {
            ['10以内加法'] = 4,
            ['10以内减法'] = 4,
            ['20以内不进位加法'] = 10,
            ['20以内不退位减法'] = 10,
            ['20以内进位加法'] = 10,
            ['20以内退位减法'] = 10,
            ['10以内连加'] = 3,
            ['10以内连减'] = 3,
            ['10以内减加'] = 3,
            ['10以内加减'] = 3,
            ['20以内连加'] = 10,
            ['20以内连减'] = 10,
            ['20以内减加'] = 10,
            ['20以内加减'] = 10,
        }
    },
    -- 一年级第二学期口算题
    {
        ['sequence'] = 18,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不进位加整十数',
        ['qtypes'] = {
            ['100以内不进位加整十数'] = 100,
        }
    },
    {
        ['sequence'] = 19,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不进位加一位数',
        ['qtypes'] = {
            ['100以内不进位加一位数'] = 100,
        }
    },
    {
        ['sequence'] = 20,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不进位加综合',
        ['qtypes'] = {
            ['100以内不进位加整十数'] = 50,
            ['100以内不进位加一位数'] = 50,
        }
    },
    {
        ['sequence'] = 21,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不退位减整十数',
        ['qtypes'] = {
            ['100以内不退位减整十数'] = 100,
        }
    },
    {
        ['sequence'] = 22,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不退位减一位数',
        ['qtypes'] = {
            ['100以内不退位减一位数'] = 100,
        }
    },
    {
        ['sequence'] = 23,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不退位减综合',
        ['qtypes'] = {
            ['100以内不退位减整十数'] = 50,
            ['100以内不退位减一位数'] = 50,
        }
    },
    {
        ['sequence'] = 24,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内不进位不退位加减综合',
        ['qtypes'] = {
            ['100以内不进位加整十数'] = 25,
            ['100以内不进位加一位数'] = 25,
            ['100以内不退位减整十数'] = 25,
            ['100以内不退位减一位数'] = 25,
        }
    },
    {
        ['sequence'] = 25,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内进位加（一位数）',
        ['qtypes'] = {
            ['100以内进位加一位数'] = 100,
        }
    },
    {
        ['sequence'] = 26,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内退位减（一位数）',
        ['qtypes'] = {
            ['100以内退位减一位数'] = 100,
        }
    },
    {
        ['sequence'] = 27,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内进位退位加减综合（一位数）',
        ['qtypes'] = {
            ['100以内进位加一位数'] = 50,
            ['100以内退位减一位数'] = 50,
        }
    },
    {
        ['sequence'] = 28,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内（两位数不进位不退位）加减',
        ['qtypes'] = {
            ['100以内不进位加两位数'] = 50,
            ['100以内不退位减两位数'] = 50,
        }
    },
    {
        ['sequence'] = 29,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内连加',
        ['qtypes'] = {
            ['100以内连加'] = 100,
        }
    },
    {
        ['sequence'] = 30,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内连减',
        ['qtypes'] = {
            ['100以内连减'] = 100,
        }
    },
    {
        ['sequence'] = 31,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内连续加减综合',
        ['qtypes'] = {
            ['100以内连加'] = 50,
            ['100以内连减'] = 50,
        }
    },
    {
        ['sequence'] = 32,
        ['grade'] = 1,
        ['semester'] = 2,
        ['name'] = '100以内综合练习',
        ['qtypes'] = {
            ['100以内不进位加整十数'] = 5,
            ['100以内不进位加一位数'] = 5,
            ['100以内不退位减整十数'] = 5,
            ['100以内不退位减一位数'] = 5,
            ['100以内进位加一位数'] = 10,
            ['100以内退位减一位数'] = 10,
            ['100以内不进位加两位数'] = 10,
            ['100以内不退位减两位数'] = 10,
            ['100以内进位加两位数'] = 10,
            ['100以内退位减两位数'] = 10,
            ['100以内连加'] = 10,
            ['100以内连减'] = 10,
        }
    },
    -- 二年级第一学期口算题
    {
        ['sequence'] = 33,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '表内乘法',
        ['qtypes'] = {
            ['表内乘法'] = 100,
        }
    },
    {
        ['sequence'] = 34,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '表内除法',
        ['qtypes'] = {
            ['表内除法'] = 100,
        }
    },
    {
        ['sequence'] = 35,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '表内乘除综合',
        ['qtypes'] = {
            ['表内乘法'] = 50,
            ['表内除法'] = 50,
        }
    },
    {
        ['sequence'] = 36,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '表内连乘',
        ['qtypes'] = {
            ['表内连乘'] = 100,
        }
    },
    {
        ['sequence'] = 37,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '表内连除',
        ['qtypes'] = {
            ['表内连除'] = 100,
        }
    },
    {
        ['sequence'] = 38,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '连乘连除综合',
        ['qtypes'] = {
            ['表内连乘'] = 50,
            ['表内连除'] = 50,
        }
    },
    {
        ['sequence'] = 39,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '连续乘除综合2',
        ['qtypes'] = {
            ['表内连乘'] = 25,
            ['表内连除'] = 25,
            ['表内除乘'] = 25,
            ['表内乘除'] = 25,
        }
    },
    {
        ['sequence'] = 40,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '乘加减两步（不进、不退）',
        ['qtypes'] = {
            ['乘不进位加两步'] = 25,
            ['不进位加乘两步'] = 25,
            ['乘不退位减两步'] = 25,
            ['不退位减乘两步'] = 25,
        }
    },
    {
        ['sequence'] = 41,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '乘加减两步（进位、退位）',
        ['qtypes'] = {
            ['乘进位加两步'] = 25,
            ['进位加乘两步'] = 25,
            ['乘退位减两步'] = 25,
            ['退位减乘两步'] = 25,
        }
    },
    {
        ['sequence'] = 42,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '除加减两步（不进、不退）',
        ['qtypes'] = {
            ['除不进位加两步'] = 25,
            ['不进位加除两步'] = 25,
            ['除不退位减两步'] = 25,
            ['不退位减除两步'] = 25,
        }
    },
    {
        ['sequence'] = 43,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '除加减两步（进位、退位）',
        ['qtypes'] = {
            ['除进位加两步'] = 33,
            ['进位加除两步'] = 33,
            ['退位减除两步'] = 34,
        }
    },
    {
        ['sequence'] = 44,
        ['grade'] = 2,
        ['semester'] = 1,
        ['name'] = '乘除加减两步综合',
        ['qtypes'] = {
            ['乘不进位加两步'] = 7,
            ['不进位加乘两步'] = 7,
            ['乘不退位减两步'] = 7,
            ['不退位减乘两步'] = 7,
            ['乘进位加两步'] = 7,
            ['进位加乘两步'] = 7,
            ['乘退位减两步'] = 7,
            ['退位减乘两步'] = 7,
            ['除不进位加两步'] = 7,
            ['不进位加除两步'] = 7,
            ['除不退位减两步'] = 6,
            ['不退位减除两步'] = 6,
            ['除进位加两步'] = 6,
            ['进位加除两步'] = 6,
            ['退位减除两步'] = 6,
        }
    },
    -- 二年级第二学期口算题
    {
        ['sequence'] = 45,
        ['grade'] = 2,
        ['semester'] = 2,
        ['name'] = '整百数加减法',
        ['qtypes'] = {
            ['整百数加法'] = 50,
            ['整百数减法'] = 50,
        }
    },
    {
        ['sequence'] = 46,
        ['grade'] = 2,
        ['semester'] = 2,
        ['name'] = '整百整十数加法（不进位）',
        ['qtypes'] = {
            ['整百整十数不进位加法'] = 100,
        }
    },
    {
        ['sequence'] = 47,
        ['grade'] = 2,
        ['semester'] = 2,
        ['name'] = '整百整十数加法（进位）',
        ['qtypes'] = {
            ['整百整十数进位加法'] = 100,
        }
    },
    {
        ['sequence'] = 48,
        ['grade'] = 2,
        ['semester'] = 2,
        ['name'] = '整百整十数减法（不退位）',
        ['qtypes'] = {
            ['整百整十数不退位减法'] = 100,
        }
    },
    {
        ['sequence'] = 49,
        ['grade'] = 2,
        ['semester'] = 2,
        ['name'] = '整百整十数减法（退位）',
        ['qtypes'] = {
            ['整百整十数退位减法'] = 100,
        }
    },
    {
        ['sequence'] = 50,
        ['grade'] = 2,
        ['semester'] = 2,
        ['name'] = '整百整十加减综合练习',
        ['qtypes'] = {
            ['整百整十数不进位加法'] = 20,
            ['整百整十数进位加法'] = 30,
            ['整百整十数不退位减法'] = 20,
            ['整百整十数退位减法'] = 30,
        }
    },
}
